ChartsOfCharacteristicTypes/МИКО_стНастройкиТелефонии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>МИКО_стНастройкиТелефонии</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>32</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>500</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МИКО_стУчетныеЗаписиАТС</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>did</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>accountcode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/МИКО_стMyPBX_Asteriskcdr.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_стMyPBX_Asteriskcdr</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>datetime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>channel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dstchannel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AcctId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>clid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dcontext</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>srctrunk</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dstrunk</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>lastapp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>billable</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>disposition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>amaflags</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>calltype</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>accountcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>uniqueid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>monitorpath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>extfld1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>extfld2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>extfld3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dst</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>src</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>uniqueid_pt1c</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_стИсторияЗвонковAskozia.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_стИсторияЗвонковAskozia</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>start</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>answer</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>end</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>src_chan</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>src_num</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dst_chan</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dst_num</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UNIQUEID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>linkedid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>did</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>disposition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>recordingfile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>from_account</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>to_account</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dialstatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>appname</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>is_app</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>billsec</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AcctId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>id_pbx</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/МИКО_стНастройкиТелефонии/Ext/ManagerModule.bsl
// #Область СлужебныеПроцедурыИФункции
///
// Основные "геттеры" / "сеттеры"
///

// Возврат количества цифр для ассоциации с контактом.
// 
Функция КоличествоХранимыхЦифрТелефона(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт 
	Если ПоУмолчанию = Истина Тогда
		Возврат 9;	
	КонецЕсли; 
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КоличествоХранимыхЦифрТелефона.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	                                            
		КонецПопытки; 
	КонецЕсли;                                          
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КоличествоХранимыхЦифрТелефона, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка) = Тип("Число") ИЛИ Настройка = 0, 9,Настройка);
	Возврат Настройка;
КонецФункции // КоличествоХранимыхЦифрТелефона()

// Идентификатор АТС.
// 
Функция id_pbx(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт 
	Если ПоУмолчанию = Истина Тогда
		Возврат 15; 	
	КонецЕсли; 
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.id_pbx.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	                                            
		КонецПопытки; 
	КонецЕсли;                                          
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.id_pbx, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка) = Тип("Число") ИЛИ Настройка = 0, 0,Настройка);
	Возврат Настройка;
КонецФункции // КоличествоХранимыхЦифрТелефона()

Функция АдресСервера(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт
	Если ПоУмолчанию = Истина Тогда
		Возврат "demo.askozia_test.ru";
	КонецЕсли; 
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.АдресСервера.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	Настройка = "" + МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.АдресСервера, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка)=Тип("Строка")ИЛИ НЕ ЗначениеЗаполнено(Настройка),"asterisk_host_ru",Настройка);
	Возврат Настройка;	
КонецФункции // АдресСервера()

Функция ПортСервера(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт
	Если ПоУмолчанию = Истина Тогда
		Возврат 80;
	КонецЕсли; 
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПортСервера.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПортСервера, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка) = Тип("Число") ИЛИ Настройка = 0, 80,Настройка);
	Возврат Настройка;

КонецФункции // ПортСервера()

Функция ПользовательСтатистики(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт
	Если ПоУмолчанию = Истина Тогда
		Возврат "statistic";
	КонецЕсли;
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИмяПользователя.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 

	Настройка = "" + МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИмяПользователя, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка)=Тип("Строка")ИЛИ НЕ ЗначениеЗаполнено(Настройка),Неопределено,Настройка);
	Возврат Настройка;	
КонецФункции // ПользовательСтатистики()

Функция Пароль(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт
	Если ПоУмолчанию = Истина Тогда
		Возврат "password";
	КонецЕсли;

	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.Пароль.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 

	Настройка = "" + МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.Пароль, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка)=Тип("Строка")ИЛИ НЕ ЗначениеЗаполнено(Настройка),Неопределено,Настройка);
	Возврат Настройка;	
КонецФункции // ПользовательСтатистики()

Функция ВремяОжиданияОтвета(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт 
	Если ПоУмолчанию = Истина Тогда
		Возврат 20;
	КонецЕсли;

	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ВремяОжиданияОтвета.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ВремяОжиданияОтвета, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка) = Тип("Число") ИЛИ Настройка = 0, 3,Настройка);
	Возврат Настройка;
КонецФункции // КоличествоХранимыхЦифрТелефона()

Функция РесурсCDR(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт
	Если ПоУмолчанию = Истина Тогда
		Возврат "/admin/1c/cdr_xml/index.php";
	КонецЕсли;
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCDR.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 

	Настройка = "" + МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCDR, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка)=Тип("Строка")ИЛИ НЕ ЗначениеЗаполнено(Настройка),"/admin/1c/cdr_xml/index.php",Настройка);
	Возврат Настройка;	

КонецФункции // РесурсCDR()

Функция РесурсCEL(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт
	Если ПоУмолчанию = Истина Тогда
		Возврат "/admin/1c/cel_xml/index.php";
	КонецЕсли;
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCEL.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	
	Настройка = "" + МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCEL, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка)=Тип("Строка")ИЛИ НЕ ЗначениеЗаполнено(Настройка),"/admin/1c/cel_xml/index.php",Настройка);
	Возврат Настройка;	

КонецФункции // РесурсCEL()

Функция МаксимальнаяДлинаВнутреннегоНомера() Экспорт
	Возврат 4;	
КонецФункции // МаксимальнаяДлинаВнутреннегоНомера()

Функция ВнешниеНомера(вр_Парам = Неопределено) Экспорт
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ВнешниеНомера.ПолучитьОбъект();
		ОбъектНастройки.ТаблицаЗначений.Загрузить(вр_Парам);
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.Ссылка,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.НомерСтроки,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.Значение,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.Представление,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.did,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.accountcode
		|ИЗ
		|	ПланВидовХарактеристик.МИКО_стНастройкиТелефонии.ТаблицаЗначений КАК МИКО_стНастройкиТелефонииТаблицаЗначений
		|ГДЕ
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.МИКО_стНастройкиТелефонии.ВнешниеНомера)";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");
	
	Возврат Результат;
КонецФункции // ВнешниеНомера()

Функция ИменаФаксов(вр_Парам = Неопределено) Экспорт
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИменаФаксов.ПолучитьОбъект();
		ОбъектНастройки.ТаблицаЗначений.Загрузить(вр_Парам);
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.Ссылка,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.НомерСтроки,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.Значение,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.Представление,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.did,
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.accountcode
		|ИЗ
		|	ПланВидовХарактеристик.МИКО_стНастройкиТелефонии.ТаблицаЗначений КАК МИКО_стНастройкиТелефонииТаблицаЗначений
		|ГДЕ
		|	МИКО_стНастройкиТелефонииТаблицаЗначений.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.МИКО_стНастройкиТелефонии.ИменаФаксов)";
	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;
КонецФункции // ИменаТранков()

Функция ИспользоватьЖурналСтатистикиВПанелиТелефонии(вр_Парам = Неопределено) Экспорт
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьЖурналСтатистикиВПанелиТелефонии.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьЖурналСтатистикиВПанелиТелефонии, "Значение");	
	Возврат (Настройка=Истина);	
КонецФункции // ИспользоватьЖурналСтатистикиВПанелиТелефонии()

Функция ИспользоватьМодульСтатистики(вр_Парам = Неопределено) Экспорт
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьМодульСтатистики.ПолучитьОбъект();
		ОбъектНастройки.Значение = (вр_Парам = Истина);
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьМодульСтатистики, "Значение");	
	Возврат (Настройка=Истина);	
КонецФункции // ИспользоватьЖурналСтатистикиВПанелиТелефонии()

Функция ИспользоватьДопАТС(вр_Парам = Неопределено) Экспорт
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьДопАТС.ПолучитьОбъект();
		ОбъектНастройки.Значение = (вр_Парам = Истина);
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИспользоватьДопАТС, "Значение");		
	Возврат (Настройка  = Истина);	
КонецФункции // ИспользоватьДопАТС()

Функция ЛицензионноеСоглашениеПринято(вр_Парам = Неопределено) Экспорт

	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ЛицензионноеСоглашениеПринято.ПолучитьОбъект();
		ОбъектНастройки.Значение = (вр_Парам = Истина);
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ЛицензионноеСоглашениеПринято, "Значение");		
	Возврат (Настройка  = Истина);	

КонецФункции // ЛицензионноеСоглашениеПринято()


Функция КлючЗащиты(вр_Парам = Неопределено) Экспорт
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КлючЗащиты.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	
	Настройка = "" + МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.КлючЗащиты, "Значение");	
	Возврат Настройка;
	
КонецФункции // АдресСервера()

Функция СтанцияMyPBX(вр_Парам = Неопределено, ПоУмолчанию = Ложь) Экспорт
	
	Если ПоУмолчанию = Истина Тогда
		Возврат Ложь;
	КонецЕсли;

	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.СтанцияMyPBX.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.СтанцияMyPBX, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка)=Тип("Булево")ИЛИ НЕ ЗначениеЗаполнено(Настройка),Ложь,Настройка);
	Возврат Настройка = Истина;
	
КонецФункции // СтанцияMyPBX()

// Возврат количества цифр для ассоциации с контактом.
// 
Функция ПозицияЗагрузкиКодовГородов(вр_Парам = Неопределено) Экспорт 
	
	Если НЕ вр_Парам = Неопределено Тогда
		ОбъектНастройки = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПозицияЗагрузкиКодовГородов.ПолучитьОбъект();
		ОбъектНастройки.Значение = вр_Парам;
		Попытка
			ОбъектНастройки.Записать();
		Исключение
			Возврат Ложь;	
		КонецПопытки; 
	КонецЕсли; 
	Настройка = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПозицияЗагрузкиКодовГородов, "Значение");	
	Настройка = ?(НЕ ТипЗнч(Настройка) = Тип("Число"), 1, Настройка);
	Возврат Настройка;
КонецФункции // КоличествоХранимыхЦифрТелефона()

// Дополнительные процедуры / функции.

// Поиск ссылки на Учетную запись АТС. Поиск производится по идентификатору линии.
// 
Функция ПолучитьПредставлениеТранкаПоИмени(Знач ИмяТранка) Экспорт
	Если НЕ ЗначениеЗаполнено(ИмяТранка) Тогда
		Возврат Справочники.МИКО_стУчетныеЗаписиАТС.ПустаяСсылка();
	КонецЕсли; 
	ИмяТранка = Врег(ИмяТранка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_стУчетныеЗаписиАТС.did,
		|	МИКО_стУчетныеЗаписиАТС.accountcode,
		|	МИКО_стУчетныеЗаписиАТС.Идентификатор,
		|	МИКО_стУчетныеЗаписиАТС.Ссылка
		|ИЗ
		|	Справочник.МИКО_стУчетныеЗаписиАТС КАК МИКО_стУчетныеЗаписиАТС";

	Результат = Запрос.Выполнить();
	ТекТранк = Результат.Выбрать();

	Пока ТекТранк.Следующий() Цикл
	 	Если ЗначениеЗаполнено(ТекТранк.did) И Врег(ТекТранк.did) = ИмяТранка Тогда
			Возврат ТекТранк.Ссылка;
		ИначеЕсли ЗначениеЗаполнено(ТекТранк.accountcode) И Врег(ТекТранк.accountcode) = ИмяТранка Тогда
			Возврат ТекТранк.Ссылка;
		ИначеЕсли ЗначениеЗаполнено(ТекТранк.Идентификатор) И Врег(ТекТранк.Идентификатор) = ИмяТранка Тогда
			Возврат ТекТранк.Ссылка;
		КонецЕсли; 
	КонецЦикла;	
	
	Возврат Справочники.МИКО_стУчетныеЗаписиАТС.ПустаяСсылка();
КонецФункции // ПолучитьПредставлениеТранкаПоИмени()

Функция ЭтоКаналФакса(Знач ИмяКанала) Экспорт
	Если НЕ ЗначениеЗаполнено(ИмяКанала) Тогда
		Возврат Ложь;
	КонецЕсли; 
	ИмяКанала = Врег(ИмяКанала);	
	врИменаТранков = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ИменаФаксов.ТаблицаЗначений.Выгрузить();
	
	Для каждого ТекТранк Из врИменаТранков Цикл
	 	Если Найти(ИмяКанала, Врег(ТекТранк.Представление))>0 Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла;
	Возврат Ложь;
КонецФункции // ЭтоКаналФакса()
 
// Проверка на принадлежность номера к служебным.
// Параметры:
//   ИмяТранка = тип "Число" / "строка".
// Возвращаемое значение:
//   Булево.   
Функция ЭтоСлужебныйНомер_miko_ajam(Знач ИмяТранка) Экспорт
	
	МассивНомеров = Новый Массив;
	// 1.0.0.5 / старые номера
	// строкой
	МассивНомеров.Добавить("0000111");
	МассивНомеров.Добавить("0000333");
	МассивНомеров.Добавить("0000444");
	МассивНомеров.Добавить("0000555");
	МассивНомеров.Добавить("0000666");
	МассивНомеров.Добавить("0000777");
	// числом
	МассивНомеров.Добавить(10000111);
	МассивНомеров.Добавить(10000333);
	МассивНомеров.Добавить(10000444);
	МассивНомеров.Добавить(10000555);
	МассивНомеров.Добавить(10000666);
	МассивНомеров.Добавить(10000777);
	// 1.0.0.6 / новые номера
	// строкой
	МассивНомеров.Добавить("10000104");
	МассивНомеров.Добавить("10000109");
	МассивНомеров.Добавить("10000111");
	МассивНомеров.Добавить("10000222");
	МассивНомеров.Добавить("10000333");
	МассивНомеров.Добавить("10000444");
	МассивНомеров.Добавить("10000555");
	МассивНомеров.Добавить("10000666");
	МассивНомеров.Добавить("10000777");
	// числом
	МассивНомеров.Добавить(110000104);
	МассивНомеров.Добавить(110000109);
	МассивНомеров.Добавить(110000111);
	МассивНомеров.Добавить(110000222);
	МассивНомеров.Добавить(110000333);
	МассивНомеров.Добавить(110000444);
	МассивНомеров.Добавить(110000555);
	МассивНомеров.Добавить(110000666);
	МассивНомеров.Добавить(110000777);
	
	Возврат (НЕ МассивНомеров.Найти(ИмяТранка) = Неопределено);
КонецФункции // ЭтоСлужебныйНомер_miko_ajam()

// Поиск идентификаторов в логах звонков.
// 
Функция НайтиИдентификаторыЛиний(UID=Неопределено) Экспорт

	масс_ACCOUNTCODE= Новый Массив;	
	масс_DID 		= Новый Массив;	
	масс_ID 		= Новый Массив;	
	масс_ID_account	= Новый Массив;	

	ИД_Линий = Новый Структура("DID,ID,ACCOUNTCODE,ID_account",масс_DID,масс_ID,масс_ACCOUNTCODE,масс_ID_account);
  	ИдентификаторыЛиний = "";
	
	Результат = Новый Структура("ИД_Линий,ИдентификаторыПредставление",ИД_Линий,ИдентификаторыЛиний);
	Попытка
		врМИКО_стСлужебный = Вычислить("МИКО_стСлужебный");
	Исключение
		Возврат Результат;
	КонецПопытки; 
	
	Если СтанцияMyPBX() = Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА МИКО_стИсторияЗвонковCDR.calltype = ""Inbound""
			|			ТОГДА МИКО_стИсторияЗвонковCDR.srctrunk
			|		КОГДА МИКО_стИсторияЗвонковCDR.calltype = ""Outbound""
			|			ТОГДА МИКО_стИсторияЗвонковCDR.dstrunk
			|	КОНЕЦ КАК Trunk
			|ИЗ
			|	РегистрСведений.МИКО_стMyPBX_Asteriskcdr КАК МИКО_стИсторияЗвонковCDR
			|//UID ГДЕ
			|//UID 	МИКО_стИсторияЗвонковCDR.uniqueid_pt1c = &UID
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР
			|		КОГДА МИКО_стИсторияЗвонковCDR.calltype = ""Inbound""
			|			ТОГДА МИКО_стИсторияЗвонковCDR.srctrunk
			|		КОГДА МИКО_стИсторияЗвонковCDR.calltype = ""Outbound""
			|			ТОГДА МИКО_стИсторияЗвонковCDR.dstrunk
			|	КОНЕЦ";
		Если UID<>Неопределено Тогда
			Запрос.УстановитьПараметр("UID", UID);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//UID","");
		КонецЕсли; 	
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
		 	Возврат Результат;
		КонецЕсли;
		
		Выборка   = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			масс_ID.Добавить(Выборка.Trunk);
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МИКО_стИсторияЗвонковCDR.channel,
			|	МИКО_стИсторияЗвонковCDR.dstchannel,
			|	МИКО_стИсторияЗвонковCDR.accountcode,
			|	МИКО_стИсторияЗвонковCDR.origextension,
			|	МИКО_стИсторияЗвонковCDR.did
			|ИЗ
			|	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_стИсторияЗвонковCDR
			|//UID ГДЕ
			|//UID	МИКО_стИсторияЗвонковCDR.UID = &UID";
		Если UID<>Неопределено Тогда
			Запрос.УстановитьПараметр("UID", UID);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//UID","");
		КонецЕсли; 	
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	МИКО_стИсторияЗвонковAskozia.src_chan КАК channel,
			               |	МИКО_стИсторияЗвонковAskozia.dst_chan КАК dstchannel,
			               |	МИКО_стИсторияЗвонковAskozia.did КАК did,
			               |	"""" КАК accountcode,
			               |	"""" КАК origextension
			               |ИЗ
			               |	РегистрСведений.МИКО_стИсторияЗвонковAskozia КАК МИКО_стИсторияЗвонковAskozia
						   |ГДЕ
						   |	МИКО_стИсторияЗвонковAskozia.UID = &UID";
			РезультатЗапроса = Запрос.Выполнить();
		КонецЕсли; 
		
		Если РезультатЗапроса.Пустой() Тогда
		 	Возврат Результат;
		КонецЕсли; 
		Префиксы_ID = Новый Массив;
		Префиксы_ID.Добавить("SIP");
		Префиксы_ID.Добавить("IAX");
		Префиксы_ID.Добавить("DAHDI");
		
		Выборка   = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
	     	Если ЗначениеЗаполнено(Выборка.did) И масс_DID.Найти(Выборка.did) = Неопределено Тогда
			   	масс_DID.Добавить(Выборка.did);
			КонецЕсли;
	     	Если ЗначениеЗаполнено(Выборка.origextension) И масс_DID.Найти(Выборка.origextension) = Неопределено Тогда
			   	масс_DID.Добавить(Выборка.origextension);
			КонецЕсли;
	     	Если ЗначениеЗаполнено(Выборка.accountcode) И масс_ACCOUNTCODE.Найти(Выборка.accountcode) = Неопределено Тогда
			   	масс_ACCOUNTCODE.Добавить(Выборка.accountcode);
			КонецЕсли;
			
			Для каждого врПрефикс Из Префиксы_ID Цикл
				Если Найти(Выборка.channel, врПрефикс + "/")>0 Тогда
					вр_ID = врМИКО_стСлужебный.ПолучитьИмяУчеткиИзКанала(Выборка.channel);
					Если СтрДлина(вр_ID)>4 И масс_ID.Найти(вр_ID) = Неопределено Тогда
						масс_ID.Добавить(вр_ID);
					ИначеЕсли СтрДлина(вр_ID)>0 И СтрДлина(вр_ID)<5 И масс_ID_account.Найти(вр_ID) = Неопределено Тогда
						масс_ID_account.Добавить(вр_ID);	
					КонецЕсли; 
				КонецЕсли; 
				Если Найти(Выборка.dstchannel, врПрефикс + "/")>0 Тогда
					вр_ID = врМИКО_стСлужебный.ПолучитьИмяУчеткиИзКанала(Выборка.dstchannel);
					Если СтрДлина(вр_ID)>4 И масс_ID.Найти(вр_ID) = Неопределено Тогда
						масс_ID.Добавить(вр_ID);
					ИначеЕсли СтрДлина(вр_ID)>0 И СтрДлина(вр_ID)< 5 И масс_ID_account.Найти(вр_ID) = Неопределено Тогда
						масс_ID_account.Добавить(вр_ID);	
					КонецЕсли;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла;
		
	КонецЕсли;
	
	ИД_Линий.Вставить("DID",масс_DID);
	ИД_Линий.Вставить("ACCOUNTCODE",масс_ACCOUNTCODE);
	ИД_Линий.Вставить("ID",масс_ID);
	ИД_Линий.Вставить("ID_account",масс_ID_account);
	
	Рез_ID = "";
	Для каждого вр_ID Из ИД_Линий.ID Цикл
	 	Рез_ID = Рез_ID + Символы.ПС + вр_ID;
	КонецЦикла;
	Если НЕ Рез_ID = "" Тогда
		ИдентификаторыЛиний = ИдентификаторыЛиний + Символы.ПС + "#####################################################################" + Символы.ПС;
		ИдентификаторыЛиний = ИдентификаторыЛиний + "Идентификаторы каналов:" + Символы.ПС;
	  	ИдентификаторыЛиний = ИдентификаторыЛиний + Рез_ID;
	КонецЕсли; 
	
	Рез_ACCOUNTCODE = "";
	Для каждого вр_ACCOUNTCODE Из ИД_Линий.ACCOUNTCODE Цикл
	 	Рез_ACCOUNTCODE = Рез_ACCOUNTCODE + Символы.ПС + вр_ACCOUNTCODE;
	КонецЦикла;
	Если НЕ Рез_ACCOUNTCODE = "" Тогда
		ИдентификаторыЛиний = ИдентификаторыЛиний + Символы.ПС + "#####################################################################" + Символы.ПС;
		ИдентификаторыЛиний = ИдентификаторыЛиний + "Accountcode:" + Символы.ПС;
	  	ИдентификаторыЛиний = ИдентификаторыЛиний + Рез_ACCOUNTCODE;
	КонецЕсли; 

	Рез_DID = "";
    Для каждого вр_DID Из ИД_Линий.DID Цикл
	 	Рез_DID = Рез_DID + Символы.ПС + вр_DID;
	КонецЦикла;
	Если НЕ Рез_DID = "" Тогда
		ИдентификаторыЛиний = ИдентификаторыЛиний + Символы.ПС + "#####################################################################" + Символы.ПС;
		ИдентификаторыЛиний = ИдентификаторыЛиний + "DID номера (номера, на котороые звонит клиент):" + Символы.ПС;
	  	ИдентификаторыЛиний = ИдентификаторыЛиний + Рез_DID;
	КонецЕсли;
	
	Рез_ID_account = "";
    Для каждого вр_ID_account Из ИД_Линий.ID_account Цикл
	 	Рез_ID_account = Рез_ID_account + Символы.ПС + вр_ID_account;
	КонецЦикла;
	Если НЕ Рез_ID_account = "" Тогда
		ИдентификаторыЛиний = ИдентификаторыЛиний + Символы.ПС + "#####################################################################" + Символы.ПС;
		ИдентификаторыЛиний = ИдентификаторыЛиний + "ID_account (внутренние номера):" + Символы.ПС;
	  	ИдентификаторыЛиний = ИдентификаторыЛиний + Рез_ID_account;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Рез_DID + Рез_ACCOUNTCODE + Рез_ID + Рез_ID_account) Тогда
	 	ИдентификаторыЛиний = "Идентификаторы не найдены...";
	КонецЕсли; 
	
	Результат = Новый Структура("ИД_Линий,ИдентификаторыПредставление",ИД_Линий,ИдентификаторыЛиний);
	Возврат Результат;
	
КонецФункции // НайтиИдентификаторыЛиний()

// #КонецОбласти
